{
  "name": "@gooddata/sdk-ui-all",
  "entries": [
    {
      "version": "8.10.0",
      "tag": "@gooddata/sdk-ui-all_v8.10.0",
      "date": "Thu, 14 Jul 2022 08:56:22 GMT",
      "comments": {
        "none": [
          {
            "comment": "DashboardView component was removed. Use Dashboard component from @gooddata/sdk-ui-dashboard instead."
          },
          {
            "comment": "Support for GoodData Cloud was added."
          },
          {
            "comment": "Dashboard filterContext selectors are public now."
          },
          {
            "comment": "Dashboard component user and permissions selectors are public now."
          },
          {
            "comment": "Catalog load is now more optimized for GoodData Platform."
          },
          {
            "comment": "Model interfaces from @gooddata/sdk-backend-spi were moved to @gooddata/sdk-model."
          },
          {
            "comment": "Global Dashboard CSS styles were removed."
          },
          {
            "comment": "SVG and CSS imports in typescript files were removed, GoodData.UI can be used without an additional bundler setup now"
          },
          {
            "comment": "Execution definition by slices/series can be now used without React. You can use the DataViewLoader @alpha version from @gooddata/sdk-ui."
          },
          {
            "comment": "The useDashboardAsyncRender hook and related commands and events that inform about the dashboard rendering status are now public."
          }
        ]
      }
    },
    {
      "version": "8.9.0",
      "tag": "@gooddata/sdk-ui-all_v8.9.0",
      "date": "Thu, 17 Mar 2022 12:48:39 GMT",
      "comments": {
        "none": [
          {
            "comment": "The dashboard commands and events related to filter modification were included in the public API."
          },
          {
            "comment": "The general dashboard events (such as DashboardSaved) were included in the public API."
          },
          {
            "comment": "The useDispatchDashboardCommand hook was added to make dispatching of the Dashboard commands easier."
          },
          {
            "comment": "The DashboardStoreAccessor, SingleDashboardStoreAccessor and DashboardStoreAccessorRepository classes were added to enable handling of the state of the Dashboard component outside the component itself."
          }
        ]
      }
    },
    {
      "version": "8.8.0",
      "tag": "@gooddata/sdk-ui-all_v8.8.0",
      "date": "Thu, 27 Jan 2022 08:25:24 GMT",
      "comments": {
        "none": [
          {
            "comment": "Support for React 17 was added. React 16 is still supported as well."
          },
          {
            "comment": "UI controls for sharing a dashboard with other users were added."
          },
          {
            "comment": "The SPI was extended with the option for managing access permissions of a metadata object."
          },
          {
            "comment": "The SPI was extended with the option for querying user groups in a workspace."
          },
          {
            "comment": "The workspace user service was extended with the option for querying users per page."
          },
          {
            "comment": "The workspace dashboard service was extended with the option for querying dashboards that are accessible only via their URL."
          },
          {
            "comment": "The workspace dashboard interface was extended with information about sharing status and access control mode."
          },
          {
            "comment": "The IListedDashboard interface was extended with the \"availability\" field."
          },
          {
            "comment": "The bug with dashboardPluginHosts validation was fixed."
          },
          {
            "comment": "Geo pushpin charts no longer support Internet Explorer 11."
          },
          {
            "comment": "The option for setting compatibility of dashboard plugins with the minEngineVersion and maxEngineVersion properties was added."
          }
        ]
      }
    },
    {
      "version": "8.7.1",
      "tag": "@gooddata/sdk-ui-all_v8.7.1",
      "date": "Tue, 14 Dec 2021 13:31:37 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fixed bug with dashboardPluginHosts validation"
          }
        ]
      }
    },
    {
      "version": "8.7.0",
      "tag": "@gooddata/sdk-ui-all_v8.7.0",
      "date": "Thu, 02 Dec 2021 08:24:11 GMT",
      "comments": {
        "none": [
          {
            "comment": "Dashboard, a component for embedding dashboards created in KPI Dashboards, is added in the beta stage."
          }
        ]
      }
    },
    {
      "version": "8.6.0",
      "tag": "@gooddata/sdk-ui-all_v8.6.0",
      "date": "Thu, 07 Oct 2021 11:37:01 GMT",
      "comments": {
        "none": [
          {
            "comment": "Opt-in support for loading user information when loading insights and dashboards was added."
          },
          {
            "comment": "Support for data sampling in the charts and the DashboardView component through execution configuration was added (available only in GoodData.CN for Vertica)."
          }
        ]
      }
    },
    {
      "version": "8.5.1",
      "tag": "@gooddata/sdk-ui-all_v8.5.1",
      "date": "Thu, 26 Aug 2021 13:55:29 GMT",
      "comments": {
        "none": [
          {
            "comment": "Some redundant token requests prevented."
          }
        ]
      }
    },
    {
      "version": "8.5.0",
      "tag": "@gooddata/sdk-ui-all_v8.5.0",
      "date": "Thu, 08 Jul 2021 09:09:51 GMT",
      "comments": {
        "none": [
          {
            "comment": "Support for the data sampling feature of GoodData.CN is added."
          },
          {
            "comment": "Support for approximate count aggregation in GoodData.CN is added."
          },
          {
            "comment": "The AttributeFilterButton component with DateFilter-like styles was added."
          },
          {
            "comment": "Support for parent-child filtering was added to the AttributeFilter and AttributeFilterButton components."
          }
        ]
      }
    },
    {
      "version": "8.4.0",
      "tag": "@gooddata/sdk-ui-all_v8.4.0",
      "date": "Thu, 03 Jun 2021 09:24:58 GMT",
      "comments": {
        "none": [
          {
            "comment": "The DateFilter component is no longer in beta and is considered stable."
          },
          {
            "comment": "In the DateFilter component, the availableGranularities property of relativeForm is deprecated. Use availableGranularities instead."
          },
          {
            "comment": "The option to disable tooltips in charts is added."
          },
          {
            "comment": "The showTitle property and the onInsightLoaded property are added to the InsightView component."
          },
          {
            "comment": "Visualization definition placeholders are added."
          },
          {
            "comment": "The option to make the legend appear as a popup if the visualization is rendered in a too small container is added."
          },
          {
            "comment": "The includeDateGranularities parameter is added to the loadDateDateDataSets request payload."
          },
          {
            "comment": "The Execute components are extended to support LoadingComponent and ErrorComponent."
          },
          {
            "comment": "The layout customizations of the DashboardView component are supported in GoodData.CN."
          },
          {
            "comment": "The useBackendStrict and useWorkspaceStrict hooks are added for better developer experience."
          }
        ]
      }
    },
    {
      "version": "8.3.1",
      "tag": "@gooddata/sdk-ui-all_v8.3.1",
      "date": "Fri, 14 May 2021 12:00:31 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fixed logout flow on Tiger >=1.1"
          }
        ]
      }
    },
    {
      "version": "8.3.0",
      "tag": "@gooddata/sdk-ui-all_v8.3.0",
      "date": "Wed, 14 Apr 2021 11:56:54 GMT",
      "comments": {
        "none": [
          {
            "comment": "DateFilter now hides options with visible: false."
          },
          {
            "comment": "DateFilter now respects name property in AbsoluteForm, RelativeForm and AllTime options."
          },
          {
            "comment": "Highcharts dependency upgraded from version 7.1.1 to 8.2.2"
          },
          {
            "comment": "Date bucket items no longer removed from request body in loadDateDataset (api-client-bear). If you need to remove bucket date items from the request, you have to filter them manually."
          },
          {
            "comment": "GoodData.CN compatibility - this version is the first version fully compatible with GoodData.CN backend"
          }
        ]
      }
    },
    {
      "version": "8.2.0",
      "tag": "@gooddata/sdk-ui-all_v8.2.0",
      "date": "Thu, 11 Mar 2021 10:47:16 GMT",
      "comments": {
        "none": [
          {
            "comment": "The ThemeProvider component is no longer in beta and is considered stable."
          },
          {
            "comment": "DashboardView, a component for embedding dashboards created in KPI Dashboards, is added in the beta stage."
          },
          {
            "comment": "The capability to validate URLs against an organization’s whitelist is added to the backend. Currently, the implementation supports only the sdk-backend-bear package backend. The sdk-backend-tiger package backend considers all validation requests valid. The responses from the backend are cached by the decorated caching backend layer."
          }
        ]
      }
    },
    {
      "version": "8.1.0",
      "tag": "@gooddata/sdk-ui-all_v8.1.0",
      "date": "Thu, 03 Dec 2020 09:40:04 GMT",
      "comments": {
        "none": [
          {
            "comment": "The dateFormat property from a BaseVisualization is passed to the definition of an IPreparedExecution and is transformed in the BearDataView so that the dates in the AFM execution response can be displayed in the desired format."
          },
          {
            "comment": "The catalog-export tool generates comprehensive DateDataset mapping."
          },
          {
            "comment": "ESM builds are added to allow the bundlers supporting them to employ tree shaking and reduce the size of the bundles."
          },
          {
            "comment": "The sdk-ui-theme-provider library containing the ThemeProvider component is added. The component fetches the selected theme object, parses it, and injects the generated CSS variables into the document body to theme the wrapped application."
          },
          {
            "comment": "The date format settings are loaded from the backend to the InsightView component."
          },
          {
            "comment": "A tooltip is added to the value of a ranking filter."
          },
          {
            "comment": "The date format option is added to the Date Filter component."
          },
          {
            "comment": "Hook alternatives for the Execute component (useCancelablePromise, useDataView, useExecution, and useDataExport) are added."
          }
        ]
      }
    },
    {
      "version": "8.0.0",
      "tag": "@gooddata/sdk-ui-all_v8.0.0",
      "date": "Thu, 08 Oct 2020 07:51:36 GMT",
      "comments": {}
    }
  ]
}
