{
    "name": "@gooddata/sdk-ui-all",
    "entries": [
        {
            "version": "11.12.0",
            "tag": "@gooddata/sdk-ui-all_v11.12.0",
            "date": "Thu, 04 Dec 2025 08:44:09 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-backend-spi: Expose `QueryMethod` across workspace `I*Query` interfaces."
                    },
                    {
                        "comment": "sdk-backend-tiger: Add support for search endpoints across various query classes (Dashboards, Insights, Measures, Attributes, Facts) to support search functionality via POST requests."
                    },
                    {
                        "comment": "sdk-ui-catalog: Add support for search endpoints in catalog queries to avoid issues with URL character limits when filtering on large datasets."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Fix translation in semantic search tree view."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Ensure AI assistant auto-scroll waits for async content (semantic search)."
                    },
                    {
                        "comment": "sdk-ui-kit: Update `checkCircle` icon."
                    },
                    {
                        "comment": "sdk-ui-catalog: Explicitly set `UiTabs` background to resolve default background color issue."
                    },
                    {
                        "comment": "sdk-ui-kit: Fix animation shift in the `LoadingSpinner` component."
                    },
                    {
                        "comment": "sdk-ui-dashboard: keep KDA attribute popovers anchored within dialog"
                    },
                    {
                        "comment": "sdk-ui-kit: ensure users with WS.ANALYZE/VIEW only see the icon once a provider is set up"
                    },
                    {
                        "comment": "sdk-ui-dashboard: align key driver dialog with latest design & accessibility guidance"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: manage users must see icon event when llm not defined"
                    },
                    {
                        "comment": "sdk-ui-dashboard: update accesibility ond key driver analysis list"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Add the amount of found key driver to the attribute selection popup"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Prevent the chatbot icon from showing to manage-only users without AI access"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Fix KDA year-over-year period comparison rendering."
                    },
                    {
                        "comment": "sdk-ui-dashboard: frontend integration for anomaly detection alerts"
                    },
                    {
                        "comment": "sdk-ui-dashboard: make attribute selection in key driver analysis more convenient"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: headline in chat is shown by normal colors, not using kpi style colors"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: update design of escalation dialog to match latest's design"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: unify the key driver analysis naming"
                    },
                    {
                        "comment": "sdk-ui-dashboard: filter out granularities that are lower than current schedule occurrence setting in org"
                    },
                    {
                        "comment": "sdk-ui-all: Update visuals for menu components in tabs."
                    },
                    {
                        "comment": "sdk-backend-base: Add option to use TTL cache for executions (set as default in dashboards)."
                    },
                    {
                        "comment": "sdk-ui-all: Improve keyboard navigation in tabs."
                    },
                    {
                        "comment": "sdk-ui-all: Support dashboard tabs in schedule dialog and in automations."
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix double execution bug in PivotTableNext with initial sort."
                    },
                    {
                        "comment": "sdk-ui-pivot: Enhance pivot table loading readiness."
                    },
                    {
                        "comment": "sdk-ui-pivot: Introduce pagination to pivot table."
                    },
                    {
                        "comment": "sdk-ui: Communicate missing cache errors in charts with multiple result windows."
                    },
                    {
                        "comment": "add filter group item UI component to sdk-ui-kit"
                    },
                    {
                        "comment": "sdk-ui-kit: Fix DropdownList No Data renderer to avoid invalid hook call order."
                    },
                    {
                        "comment": "Fix: Sanitize invalid parent filter links during filter override merge (serialized filters delivered via URL parameter)"
                    },
                    {
                        "comment": "Added: Allow plugin customized dashboards to render without \"Modify by plugin\" overlays"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Disable alert option in widget context menu if user can't create automations and doesn't have any existing alerts."
                    },
                    {
                        "comment": "sdk-backend-tiger: Exclude alerts created on dashboard with evaluation frequency from schedule list."
                    }
                ]
            }
        },
        {
            "version": "11.11.0",
            "tag": "@gooddata/sdk-ui-all_v11.11.0",
            "date": "Thu, 27 Nov 2025 07:59:24 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-dashboard: Display location name for geochart as table."
                    },
                    {
                        "comment": "sdk-model: Introduce `semanticSearch` into `IGenAIChatInteraction`."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Introduce semantic search results rendering into the AI assistant."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Update suggestion and feedback button sizes"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Remove the chatbot answer icon from the AI assistant."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Add semantic search header with icon above search results."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: standalone embed gen-ai chat component wrongly load settings"
                    },
                    {
                        "comment": "sdk-ui-dashboard: frontend integration for anomaly detection alerts"
                    },
                    {
                        "comment": "sdk-ui-dashboard: The drill-down option is hidden when there are no items"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Adjust layout so attribute value labels no longer overlap axis labels"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Enable triggering the key driver analysis popup from chatbot tables"
                    },
                    {
                        "comment": "api-client-tiger: update client specifications based on current definition in open spec doc"
                    },
                    {
                        "comment": "sdk-ui-dashboard: align UI workflows with new anomaly detection alert granularity model, apply right date filter and filter out date filters"
                    },
                    {
                        "comment": "sdk-ui-all: Improve design and behavior of tabs."
                    },
                    {
                        "comment": "sdk-ui-all: Improved tab renaming UX."
                    },
                    {
                        "comment": "sdk-ui-all: Use a placeholder tab variant when there is only one tab."
                    },
                    {
                        "comment": "sdk-ui-all: Improve design of tabs in dashboard dialogs"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Support alerts on dashboard tabs"
                    },
                    {
                        "comment": "gdc-ui-all: Support export of dashboards with tabs."
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix multiple grand total positioning issues."
                    },
                    {
                        "comment": "sdk-ui-dashboard: Fix app crashes caused by missing metric in alert creation."
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix pivot table grand total top positioning data loading."
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix pivot table with top grand total position and sorting."
                    },
                    {
                        "comment": "Add @alpha support for GeoJSON features retrieval in sdk-model, api-client-tiger, sdk-backend-spi, sdk-backend-base, sdk-backend-tiger and sdk-ui."
                    },
                    {
                        "comment": "Add @alpha support for GeoAreaChart."
                    },
                    {
                        "comment": "Add @alpha support for multiple execution layers in insight definition."
                    },
                    {
                        "comment": "gdc-ui-all: Introduce drill to specific tab on dashboards."
                    },
                    {
                        "comment": "sdk: Introduce Filter Views per Tab Identifier"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Update drill app state to be tab-aware"
                    },
                    {
                        "comment": "sdk-ui-dashboard: New schedule export attachments and fixes."
                    },
                    {
                        "comment": "Added support for Slovenian language"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: fix accessibility issues with feedback"
                    }
                ]
            }
        },
        {
            "version": "11.10.0",
            "tag": "@gooddata/sdk-ui-all_v11.10.0",
            "date": "Thu, 20 Nov 2025 08:13:37 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-dashboard: Fix date filter initialization from automation id."
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix error handling in pivot table."
                    },
                    {
                        "comment": "sdk-ui-semantic-search: Add additional automation test IDs."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: should disable KDA for the chart from chatbot using unsupported granularity"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: possible to define custom landing screen"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: repair of triggering KDA fails with “Invalid time value”"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Visual formatting error when text starts with a hashtag (#)"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: can't open viz from chatbot if using this week date filter"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: ai chatbot hangs when clicking 'Reset' during response"
                    },
                    {
                        "comment": "sdk-ui-dashboard: date period change in key driver analysis not work"
                    },
                    {
                        "comment": "sdk-ui-dashboard: attribute filter is not display properly in chatbot"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: ai negative feedback textarea not rendered correctly"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Adjust the SDK for AI Assistant to be able to define object types to be included in search UC"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Add ability to rename dashboard tabs."
                    },
                    {
                        "comment": "sdk-backend-tiger: All export types can now override the default timeout."
                    },
                    {
                        "comment": "sdk-backend-tiger: Make the export result timeout configurable"
                    },
                    {
                        "comment": "api-client-tiger: Generated client now exports individual core API methods (e.g., EntitiesApi_GetEntityWorkspaceDataFilters, DashboardsApi_GetAllEntitiesAnalyticalDashboards) directly via the entry point. These core methods are tree-shakable and represent the preferred way to use the API. Factory methods (e.g., tigerEntitiesObjectsClientFactory) remain available for backward compatibility."
                    },
                    {
                        "comment": "api-client-tiger: Migrate enums from const objects to typed string unions. All enum types (e.g., ApiEntitlementNameEnum) are now defined as string union types (e.g., type Enum = \"value1\" | \"value2\") instead of const objects with derived types."
                    },
                    {
                        "comment": "sdk-ui-dashboard: Move filters to the second tab of Alert dialog"
                    },
                    {
                        "comment": "gdc-ui-all: Handle missing date filter config in all cases"
                    },
                    {
                        "comment": "sdk-ui-all: Rename two properties related to the dashboard tabs."
                    },
                    {
                        "comment": "sdk-ui-pivot: Introduce grand total rows position option to pivot table next."
                    },
                    {
                        "comment": "sdk-ui-dashboard: change dashboard component app state to reflect changes related to dashboard tabs"
                    },
                    {
                        "comment": "sdk-backend-tiger: allow to save multiple filter context for dashboard tabs"
                    },
                    {
                        "comment": "Change dashboard component app state to reflect changes related to the dashboard tabs"
                    },
                    {
                        "comment": "AI feedback fixes"
                    }
                ]
            }
        },
        {
            "version": "11.9.0",
            "tag": "@gooddata/sdk-ui-all_v11.9.0",
            "date": "Thu, 13 Nov 2025 07:39:54 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-model: Add artificial `NONE` code to `SemanticQualityIssueCode` for frontend filtering purposes."
                    },
                    {
                        "comment": "sdk-ui-catalog: Implement artificial `Without issues` filtering option so that users can filter out objects without any semantic quality issues."
                    },
                    {
                        "comment": "sdk-ui-kit: Update empty state color in `UiAsyncTableEmptyState`."
                    },
                    {
                        "comment": "sdk-backend: Add `excludeStrategy` to `IMemoryItemsFilterOptions`."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Support KDA in chatbot visualisation drill, repair summary if no keys drivers "
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Key driver analysis use metric title and right granularity format, updated SDK client"
                    },
                    {
                        "comment": "feat: Ability to create a new dashboard tab"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Add ability to delete dashboard tabs."
                    },
                    {
                        "comment": "sdk-ui-dashboard: Handle situation with custom date filter options"
                    },
                    {
                        "comment": "sdk-ui-pivot: Do not use multi-sort in pivot table by default."
                    },
                    {
                        "comment": "sdk-ui-pivot: Add pivot table keyboard navigation."
                    },
                    {
                        "comment": "sdk-ui-pivot: Enhance keyboard navigation in pivot table - row/column selection and multi-sort on headers."
                    },
                    {
                        "comment": "sdk-ui-geo: Increase data points limit for geo charts from 25,000 to 50,000."
                    },
                    {
                        "comment": "sdk-ui-semantic-search: Migrate to css modules"
                    },
                    {
                        "comment": "chore: Upgrade sass to 1.70.0"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Changed: Feature flag enableDashboardFiltersApplyModes has been removed. The \"Apply all dashboard filter changes at once\" is available to everyone by default. "
                    },
                    {
                        "comment": "sdk-ui-kit: Fixing UIAsyncTable row height"
                    }
                ]
            }
        },
        {
            "version": "11.8.0",
            "tag": "@gooddata/sdk-ui-all_v11.8.0",
            "date": "Thu, 06 Nov 2025 08:32:11 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-dashboard: filters config and date dataset selection for rich text"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Do not show hidden objects in AI chat suggestions."
                    },
                    {
                        "comment": "sdk-model: Extend quality issue types with `attributeName` and `title`."
                    },
                    {
                        "comment": "sdk-ui-kit: Update `UiCard` and `UiDrawer` styles to match the latest design."
                    },
                    {
                        "comment": "sdk-ui-catalog: Implement catalog detail validations tab redesign with new interactions."
                    },
                    {
                        "comment": "sdk-ui-catalog: Redesign the filters."
                    },
                    {
                        "comment": "sdk-backend: Enhance `IFilterBaseOptions` with exclusion fields."
                    },
                    {
                        "comment": "sdk-ui-catalog: Filter queries now support excluding filter values when 'All except ...' option is selected."
                    },
                    {
                        "comment": "sdk-ui-catalog: Implement filter reset button allowing users to clear all applied filters with a single action."
                    },
                    {
                        "comment": "sdk-ui-kit: Add new `hiddenForAi` icon."
                    },
                    {
                        "comment": "sdk-ui-filters: turn on Date Filter Accessibility"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Cannot trigger KDA option from drill menu on certain charts."
                    },
                    {
                        "comment": "sdk-ui-dashboard: Cannot add filter via \"Plus\" button."
                    },
                    {
                        "comment": "sdk-ui-dashboard: Filter when drilling into driver is not behaving correctly"
                    },
                    {
                        "comment": "sdk-ui-dashboard: update key drivers chart to show only attributes with same trend, support char single bar color to differentiate driver"
                    },
                    {
                        "comment": "api-client-tiger: update client for new definition in ai chat bot"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: support key driver analysis in chatbot"
                    },
                    {
                        "comment": "sdk-ui-dashboard: recalculate metric value when is not provided to key driver analysis dialog"
                    },
                    {
                        "comment": "sdk-ui-dashboard: remove filters with ALL from KDA initial run"
                    },
                    {
                        "comment": "sdk-ui-kit: Modularize UiTabs component"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Ability to reorder dashboard tabs"
                    },
                    {
                        "comment": "sdk-ui-filters: Cleanup filter accessibility feature flag"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Redesign schedule dialog to support dashboard tabs"
                    },
                    {
                        "comment": "sdk-ui-pivot: PivotTableNext is now enabled by default and promoted from @alpha to @public. This new pivot table component, built on AG Grid Enterprise, offers better performance, text wrapping, and cell selection capabilities. PivotTableNext will be exported as PivotTable in the next major release and thus replace the legacy PivotTable component. To try out new features, users should use PivotTableNext instead of PivotTable."
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix initial grow to fit behaviour in new pivot tables"
                    },
                    {
                        "comment": "sdk-ui-geo: Add @alpha support for geo area labels in sdk-model, sdk-backend-tiger and data modeler app."
                    },
                    {
                        "comment": "sdk-ui-charts: Fixed: Do not count \"invisible\" styling metrics in bucket item rules to not disable various chart controls that works only for limited number of rendered metrics."
                    },
                    {
                        "comment": "fix: prevent overriding selected dashboard filters with empty default value"
                    },
                    {
                        "comment": "sdk-ui-kit: Add variant-delete class to ListItem component"
                    },
                    {
                        "comment": "api-client-tiger: Updating OpenAPI client."
                    },
                    {
                        "comment": "sdk-ui-gen-ai: add chat feedback popup"
                    }
                ]
            }
        },
        {
            "version": "11.7.1",
            "tag": "@gooddata/sdk-ui-all_v11.7.1",
            "date": "Mon, 03 Nov 2025 08:30:02 GMT",
            "comments": {}
        },
        {
            "version": "11.7.0",
            "tag": "@gooddata/sdk-ui-all_v11.7.0",
            "date": "Thu, 30 Oct 2025 08:25:43 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-model: Add `isHidden` property to metadata objects."
                    },
                    {
                        "comment": "sdk-backend-tiger: Added support for reading and writing the `isHidden` property on metadata objects."
                    },
                    {
                        "comment": "sdk-ui-catalog: Introduce UI toggle for hiding objects from AI results"
                    },
                    {
                        "comment": "api-client-tiger: Update generated client."
                    },
                    {
                        "comment": "sdk-model: Add `status` field to `ISemanticQualityReport` in order to track the status of the quality report calculation."
                    },
                    {
                        "comment": "sdk-backend-tiger: Add `AbortSignal` support to semantic quality service `getQualityReport` method."
                    },
                    {
                        "comment": "sdk-ui-catalog: Tweak the quality score card date display to show only the year, month, and day to prevent overly long date strings."
                    },
                    {
                        "comment": "sdk-backend: Add `isHidden` filter support to backend metadata queries."
                    },
                    {
                        "comment": "sdk-ui-catalog: Add support for AI visibility filtering."
                    },
                    {
                        "comment": "sdk-ui-kit: adding data-testid for some elements"
                    },
                    {
                        "comment": "sdk-ui-catalog: fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "sdk-ui-catalog: Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: AI chatbot UI shows Chatbot restart when backend return \"Some terms weren't recognized\" "
                    },
                    {
                        "comment": "sdk-ui-dashboard: Use filters from dashboard and also drill (apply filter) on graph click"
                    },
                    {
                        "comment": "sdk-ui-dashboard: fix error that appears when drilling into some drivers"
                    },
                    {
                        "comment": "sdk-ui-dashboard: blank page appears when clicking on certain data points"
                    },
                    {
                        "comment": "fix: Make menu items properly selectable to align with ARIA"
                    },
                    {
                        "comment": "fix: Display focus outline on the \"Only\" filter option in Safari"
                    },
                    {
                        "comment": "fix: Do not leak arrow key event from new filter creation popup"
                    },
                    {
                        "comment": "sdk-ui-gen-ai: Fix AG grid token propagation for the new pivot table"
                    },
                    {
                        "comment": "home-ui: Improving AI Memory UI"
                    },
                    {
                        "comment": "sdk-ui-kit: Ability to specify to the header menu item use the starting path to check if the item is active."
                    }
                ]
            }
        },
        {
            "version": "11.6.0",
            "tag": "@gooddata/sdk-ui-all_v11.6.0",
            "date": "Thu, 23 Oct 2025 07:42:08 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-kit: Add `recommendation` icon."
                    },
                    {
                        "comment": "sdk-ui-catalog: Add support for filtering catalog items by semantic quality validations."
                    },
                    {
                        "comment": "sdk-model: Remove ERROR semantic quality issue severity and add severity order constant."
                    },
                    {
                        "comment": "sdk-ui-catalog: Introduce semantic quality issue grouping by code and severity."
                    },
                    {
                        "comment": "sdk-ui-catalog: Introduce `ISemanticQualityReport` interface with additional metadata like `updatedAt`."
                    },
                    {
                        "comment": "sdk-backend: Rename `getQualityIssues` to `getQualityReport`."
                    },
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai]: AI chatbot UI shows Chatbot restart when backend return \"Some terms weren't recognized\" "
                    },
                    {
                        "comment": "[sdk-ui-dashboard] KDA Cannot Be Triggered When Visualization Is Sliced by Date–Week/Year, Support table chart for drill"
                    },
                    {
                        "comment": "[sdk-ui-dashboard]: repair KDA graph to show relevant key drivers"
                    },
                    {
                        "comment": "[api-client-tiger]: Update definition from new server openapi specs"
                    },
                    {
                        "comment": "[sdk-ui-dashboard]: Update key driver analysis dialog to use new api + some minor fixes"
                    },
                    {
                        "comment": "[sdk-ui-dashboard] Drivers Detail Chart - the columns don’t match the driver names for negative values. Cannot activate Year-over-Year option for chart sliced by Week."
                    },
                    {
                        "comment": "[sdk-ui-dashboard]: prepare for filters from dashboard, repairs for more slicing"
                    },
                    {
                        "comment": "fix: Display focus outline on the \"Only\" filter option in Safari"
                    },
                    {
                        "comment": "Improved focus handling in insights"
                    },
                    {
                        "comment": "Bubble chart produces just single series to align its behavior with other charts and improve its accessibility"
                    },
                    {
                        "comment": "Fix accessible tooltip on some charts"
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix bug when custom metric in transposed table has original title instead of provided title"
                    },
                    {
                        "comment": "sdk-ui-pivot: Fix unexpected active/disabled pivot table menu wrapping items"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Fix dispatch of visualization properties in view mode for pivot table"
                    },
                    {
                        "comment": "LDM Modeler: Added support for column description field from scan API"
                    },
                    {
                        "comment": "Add new MapLibre-based geo pushpin chart implementation, currently exported as @alpha from @gooddata/sdk-ui-geo/next."
                    },
                    {
                        "comment": "[api-client-tiger]: update openapi spec to include new memory item endpoint"
                    },
                    {
                        "comment": "[home-ui]: Add AI Memory to workspace catalog."
                    },
                    {
                        "comment": "Removing AI Memory POC UI"
                    }
                ]
            }
        },
        {
            "version": "11.5.0",
            "tag": "@gooddata/sdk-ui-all_v11.5.0",
            "date": "Fri, 17 Oct 2025 07:29:11 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduce React compatibility testing app for dashboard plugins"
                    },
                    {
                        "comment": "api-client-tiger: Expose quality issues API types."
                    },
                    {
                        "comment": "sdk-model: Introduce semantic quality domain model and feature flag."
                    },
                    {
                        "comment": "sdk-backend-tiger: Implement semantic quality service"
                    },
                    {
                        "comment": "sdk-ui-catalog: Introduce semantic quality UI integration"
                    },
                    {
                        "comment": "sdk-ui-catalog: Fix font styles for the embedding case"
                    },
                    {
                        "comment": "sdk-ui-model: Introduce `ISemanticQualityIssuesCalculation` that represents the state of a semantic quality issues calculation."
                    },
                    {
                        "comment": "api-client-tiger: Expose semantic quality calculation endpoints."
                    },
                    {
                        "comment": "sdk-ui-catalog: Introduce semantic quality score card with capability to run a semantic quality check."
                    },
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai]: AI chatbot UI shows Chatbot restart when backend return \"Some terms weren't recognized\" "
                    },
                    {
                        "comment": "[sdk-ui]: Support normalizedValue in execution, propagate into KDA dialog, update date formatter"
                    },
                    {
                        "comment": "key driver analysis implementation, load from backend, update dialog"
                    },
                    {
                        "comment": "[sdk-ui-dashboard]: Support for graph in key driver detail"
                    },
                    {
                        "comment": "[sdk-ui-dashboard]: Ellipses in key driver list, Filter only supported attributes"
                    },
                    {
                        "comment": "[sdk-backend-spi]: Rename kda => keyDriverAnalysis"
                    },
                    {
                        "comment": "[sdk-api-client]: Update client by latest openapi specs"
                    },
                    {
                        "comment": "[sdk-ui-dashboard] Period switch support, Internal definitions for attr filter update, Update design and logic of kda graph"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai] allow accessible tooltip in vis"
                    },
                    {
                        "comment": "Fix: Close the drill window when a filter option is selected"
                    },
                    {
                        "comment": "fix: Display drill menu above chart tooltips"
                    },
                    {
                        "comment": "Improve accessibility of recipient list"
                    },
                    {
                        "comment": "Fixed: Dashboard widget insight menu did not always fit into a mobile viewport."
                    },
                    {
                        "comment": "Fixed: Static descriptions of dashboard sections do not need to wait for filters to load."
                    },
                    {
                        "comment": "Added: Tiger API client has been updated to match the latest backend state."
                    }
                ]
            }
        },
        {
            "version": "11.4.0",
            "tag": "@gooddata/sdk-ui-all_v11.4.0",
            "date": "Fri, 10 Oct 2025 08:42:12 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai]: AI chatbot UI shows Chatbot restart when backend return \"Some terms weren't recognized\" "
                    },
                    {
                        "comment": "[sdk-ui-kit]: Chatbot icon does not have enough contrast against the background"
                    },
                    {
                        "comment": "[sdk-ui-kit]: Upgrade codemirror"
                    },
                    {
                        "comment": "[sdk-ui-dashboard]: support KDA drill menu in graph with date attribute"
                    },
                    {
                        "comment": "Improve single select attribute filter"
                    },
                    {
                        "comment": "Fix issue with latest Safari not rendering dashboards visualizations."
                    }
                ]
            }
        },
        {
            "version": "11.3.0",
            "tag": "@gooddata/sdk-ui-all_v11.3.0",
            "date": "Wed, 08 Oct 2025 11:02:53 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-kit: Introduced optional `autoFocus` behavior to `UiTreeview` component so nothing is focused by default when `autoFocus` is disabled."
                    },
                    {
                        "comment": "sdk-ui-semantic-search: Disable initial `autoFocus` for history items."
                    },
                    {
                        "comment": "sdk-model: Introduced `SharePermission` and adds optional `sharePermissions` to `IAccessControlAware`."
                    },
                    {
                        "comment": "sdk-ui-spi: Add `withMetaInclude` to `IDashboardsQuery`."
                    },
                    {
                        "comment": "sdk-backend-tiger: Add support for `metaInclude` in dashboards query"
                    },
                    {
                        "comment": "sdk-ui-catalog: Introduce `isEditable` property to `ICatalogItem`."
                    },
                    {
                        "comment": "sdk-ui-catalog: Disallow editing of dashboards without proper permissions."
                    },
                    {
                        "comment": "sdk-backend-spi: Add missing `IGetMeasureOptions` interface with `loadUserData` option."
                    },
                    {
                        "comment": "sdk-backend-tiger: Enhance `getMeasure` to accept `IGetMeasureOptions` with `loadUserData` option."
                    },
                    {
                        "comment": "sdk-backend-catalog: Load user data for measures in the detail view."
                    },
                    {
                        "comment": "sdk-ui-catalog: Fix incorrect import of the Intl provider in catalog detail."
                    },
                    {
                        "comment": "sdk-ui-catalog: Make the `objectId` and `objectType` props required in the public API of catalog detail components."
                    },
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "[ui-sdk-gen-ai] Missing button tooltips on focus"
                    },
                    {
                        "comment": "[sdk-ui-kit] Support badge on button"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai] Switch to table on every visualisation"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai]: Save button incorrectly available in AI chatbot when insight fails to render"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai]: AI chatbot UI shows Chatbot restart when backend return \"Some terms weren't recognized\" "
                    },
                    {
                        "comment": "[sdk-ui-backend-tiger]: feature flag for enableChangeAnalysis"
                    },
                    {
                        "comment": "Fix: Add proper a11y attributes to saved views"
                    },
                    {
                        "comment": "Return default feature flags on FeatureHub request failure."
                    },
                    {
                        "comment": "Added validation to ensure plugin names use snake_case instead of kebab-case"
                    },
                    {
                        "comment": "Improve accessibility of single select AF"
                    },
                    {
                        "comment": "New iconButton variant. New submenu header component."
                    },
                    {
                        "comment": "Fix date filter accessibility issue"
                    },
                    {
                        "comment": "Improve semantics of InvertableSelectAllCheckbox"
                    },
                    {
                        "comment": "Improve bypass navigation"
                    },
                    {
                        "comment": "Remove unused feature flag: enableEditInsightsFromKD"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAnalyticalDashboards"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAdDescriptionEdit"
                    },
                    {
                        "comment": "Remove unused feature flag: enableDuplicatedLabelValuesInAttributeFilter"
                    },
                    {
                        "comment": "Remove unused feature flag: enableNewNavigationForResponsiveUi"
                    }
                ]
            }
        },
        {
            "version": "11.2.0",
            "tag": "@gooddata/sdk-ui-all_v11.2.0",
            "date": "Thu, 02 Oct 2025 09:04:26 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Remove unused feature flag: enableActiveFilterContext"
                    },
                    {
                        "comment": "sdk-ui-kit: Add `aria-autocomplete` to accessibility configuration."
                    },
                    {
                        "comment": "sdk-ui-semantic-search: Improve semantic search accessibility attributes."
                    },
                    {
                        "comment": "api-client-tiger: Update client to include `tags`, `createdBy` and `getQualityIssues` endpoints"
                    },
                    {
                        "comment": "sdk-backend-tiger: Add missing side-loaded data to metrics queries."
                    },
                    {
                        "comment": "sdk-backend: Added `getCreatedBy` method to `IAnalyticsCatalogService` for retrieving creator information."
                    },
                    {
                        "comment": "sdk-ui-kit: Add `renderActions` prop to `DropdownInvertableSelect` component."
                    },
                    {
                        "comment": "sdk-ui-catalog: Add support for created by filtering."
                    },
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "[sdk-ui-kit]: sometimes tags additinal nubmer is hidden under cointainer box"
                    },
                    {
                        "comment": "[sdk-ui-kit]: Update chip to support only disabled state, Update popover and tooltip behaviour"
                    },
                    {
                        "comment": "[sdk-ui-dashboard]: Added attributes settings into footer + some minor changes"
                    },
                    {
                        "comment": "[sdk-ui-dashboard] KDA dioalog: Empty page on design, Switch on filled trend if any"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai]: Chatbot accessibility repairs"
                    },
                    {
                        "comment": "[sdk-ui-kit] Repair of UiFocusTrap to be albe react on props change"
                    },
                    {
                        "comment": "Escape nonstandard characters in email"
                    },
                    {
                        "comment": "sdk-ui-kit: Update `UiDate` so that relative timestamps under one minute use the localized `now` text instead of showing the number of seconds ago."
                    },
                    {
                        "comment": "Remove unused feature flag: enableInvalidValuesInAttributeFilter"
                    },
                    {
                        "comment": "Enable automation management by default."
                    },
                    {
                        "comment": "Remove unused feature flag: ADCatalogGroupsExpanded"
                    },
                    {
                        "comment": "Remove unused feature flag: ADMeasureValueFilterNullAsZeroOption"
                    },
                    {
                        "comment": "Remove unused feature flag: activeFiltersByDefault"
                    },
                    {
                        "comment": "Remove unused feature flag: analyticalDesigner"
                    },
                    {
                        "comment": "Remove unused feature flag: cellMergedByDefault"
                    },
                    {
                        "comment": "Remove unused feature flag: disableKpiDashboardHeadlineUnderline"
                    },
                    {
                        "comment": "Remove unused feature flag: enableADMultipleDateFilters"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAdAdditionalDateAttributes"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAdCatalogRefresh"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAdRankingFilter"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAlternativeDisplayFormSelection"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAnalyticalDashboardPermissions"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAnalyticalDesignerExport"
                    },
                    {
                        "comment": "Remove unused feature flag: enableApproxCount"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAttributeFilterValuesValidation"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAxisLabelFormat"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAxisNameConfiguration"
                    },
                    {
                        "comment": "Remove unused feature flag: enableAxisNameViewByTwoAttributes"
                    },
                    {
                        "comment": "Remove unused feature flag: enableChartsSorting"
                    },
                    {
                        "comment": "Remove unused feature flag: enableClickableAttributeURL"
                    },
                    {
                        "comment": "Remove unused feature flag: enableColumnHeadersPosition"
                    },
                    {
                        "comment": "Remove unused feature flag: enableCompanyLogoInEmbeddedUI"
                    },
                    {
                        "comment": "Remove unused feature flag: enableCsvUploader"
                    },
                    {
                        "comment": "Remove unused feature flag: enableCustomColorPicker"
                    },
                    {
                        "comment": "Remove unused feature flag: enableDataSampling"
                    },
                    {
                        "comment": "Remove unused feature flag: enableDrilledInsightExport"
                    },
                    {
                        "comment": "Remove unused feature flag: enableEmbedButtonInAD"
                    },
                    {
                        "comment": "Remove unused feature flag: enableEmbedButtonInKD"
                    },
                    {
                        "comment": "Remove unused feature flag: enableExploreInsightsFromKD"
                    },
                    {
                        "comment": "Remove unused feature flag: enableHidingOfWidgetTitle"
                    },
                    {
                        "comment": "Remove unused feature flag: enableInsightExportScheduling"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKDZooming"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardDeleteFilterButton"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardDrillFromAttribute"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardDrillToDashboard"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardDrillToInsight"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardDrillToURL"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardImplicitDrillDown"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardSaveAsNew"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardScheduleRecipients"
                    },
                    {
                        "comment": "Remove unused feature flag: enableKPIDashboardSchedule"
                    },
                    {
                        "comment": "Remove dead bear-related code"
                    },
                    {
                        "comment": "Remove unused feature flag: enableLongitudeAndLatitudeLabels"
                    },
                    {
                        "comment": "Remove unused feature flag: enableMeasureValueFilters"
                    },
                    {
                        "comment": "Remove unused feature flag: enabledMetricDateFilter"
                    },
                    {
                        "comment": "Remove unused feature flag: enableMultipleCSVs"
                    },
                    {
                        "comment": "Remove unused feature flag: enableMultipleDates"
                    },
                    {
                        "comment": "Remove unused feature flag: enableNewADFilterBar"
                    },
                    {
                        "comment": "Remove unused feature flag: enablePdmRemovalDeprecationPhase"
                    },
                    {
                        "comment": "Remove unused feature flag: enablePivotTableTransposition"
                    },
                    {
                        "comment": "Remove unused feature flag: enablePixelPerfectExperience"
                    },
                    {
                        "comment": "Remove unused feature flag: enableRenamingMeasureToMetric"
                    },
                    {
                        "comment": "Remove unused feature flag: enableRenamingProjectToWorkspace"
                    },
                    {
                        "comment": "Remove unused feature flag: enableReversedStacking"
                    },
                    {
                        "comment": "Remove unused feature flag: enableSeparateTotalLabels"
                    },
                    {
                        "comment": "Remove unused feature flag: enableSortingByTotalGroup"
                    },
                    {
                        "comment": "Remove unused feature flag: enableUnavailableItemsVisible"
                    },
                    {
                        "comment": "Remove unused feature flag: hidePixelPerfectExperience"
                    },
                    {
                        "comment": "Remove unused feature flag: showHiddenCatalogItems"
                    },
                    {
                        "comment": "Remove unused entitlements (all are now enabled by default): CustomTheming, UiLocalization, WhiteLabeling, PdfExports"
                    },
                    {
                        "comment": "Update dashboard logo alt text to display organization name when custom logo is applied, for accessibility purposes."
                    },
                    {
                        "comment": "sdk-ui-filters: remove react-window library and let dropdowns with fixed item count render without it"
                    },
                    {
                        "comment": "Fixed: UI Kit menu item must respect the width of its container"
                    },
                    {
                        "comment": "create alert/schedule dialog accessibility, changes to sdk components"
                    }
                ]
            }
        },
        {
            "version": "11.1.0",
            "tag": "@gooddata/sdk-ui-all_v11.1.0",
            "date": "Thu, 25 Sep 2025 08:07:44 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-dashboard: Added tabular PDF export option in drill down"
                    },
                    {
                        "comment": "sdk-ui-dashboard: Settings for PDF tabular export"
                    },
                    {
                        "comment": "sdk-ui-catalog: Filter by tag when a tag is clicked in the table. This enables quick drill into tagged items directly from the table without opening filter panel."
                    },
                    {
                        "comment": "sdk-backend-spi: Add full-text `search` to `IFilterBaseOptions`"
                    },
                    {
                        "comment": "sdk-ui-catalog: Add full-text search to the catalog, temporarily replacing semantic search."
                    },
                    {
                        "comment": "sdk-ui-catalog: Show the total count of items by object type in the tooltip"
                    },
                    {
                        "comment": "sdk-model: Introduce `dataSet` property to attribute `IAttributeMetadataObject` and fact `IFactMetadataObject` metadata objects."
                    },
                    {
                        "comment": "sdk-backend: Expose dataset metadata on attribute/fact builders and tiger converters."
                    },
                    {
                        "comment": "sdk-ui-catalog: Show dataset title in the catalog detail view for attributes and facts."
                    },
                    {
                        "comment": "[sdk-ui-catalog] Detail drawer is open fullscreen "
                    },
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "[sdk-ui-ext] Added KDA dialog component designs"
                    },
                    {
                        "comment": "[sdk-ui-catalog] tags filter is not sorted alphabetically"
                    },
                    {
                        "comment": "Added method for setting format locale to settings services"
                    },
                    {
                        "comment": "UiAyncTable: general grid a11y, changes to table structure"
                    },
                    {
                        "comment": "Improve accessibility of attribute filter"
                    },
                    {
                        "comment": "Remove unused feature flag: enableBulletChart"
                    },
                    {
                        "comment": "Remove unused feature flag: enableHidingOfDataPoints"
                    },
                    {
                        "comment": "Remove unused feature flag: enablePushpinGeoChart"
                    },
                    {
                        "comment": "Remove unused feature flag: enableTableColumnsAutoResizing"
                    },
                    {
                        "comment": "Remove unused feature flag: enableTableColumnsGrowToFit"
                    },
                    {
                        "comment": "Remove unused feature flag: enableTableColumnsManualResizing"
                    },
                    {
                        "comment": "Remove unused feature flag: enableWeekFilters"
                    },
                    {
                        "comment": "Remove unused feature flag: hideKpiDrillInEmbedded"
                    }
                ]
            }
        },
        {
            "version": "11.0.0",
            "tag": "@gooddata/sdk-ui-all_v11.0.0",
            "date": "Mon, 22 Sep 2025 08:18:19 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-catalog: Fix mismatch typo between `visualizationType` property and its type in the `ICatalogItem` interface"
                    },
                    {
                        "comment": "sdk-backend: Implement GenAI Analytics Catalog service"
                    },
                    {
                        "comment": "sdk-ui-catalog: Add support for tags filtering"
                    },
                    {
                        "comment": "sdk-ui-catalog: Update the tooltip text content for the catalog help icon."
                    },
                    {
                        "comment": "sdk-ui-kit: Extend `DropdownInvertableSelect` with `header` prop to support custom header in the dropdown."
                    },
                    {
                        "comment": "sdk-ui-kit: Extend `DropdownInvertableSelect` with  `renderNoData` prop"
                    },
                    {
                        "comment": "sdk-ui-kit: Extend `DropdownInvertableSelect` with `alignPoints` prop to support custom alignment."
                    },
                    {
                        "comment": "sdk-ui-catalog: Improve responsiveness on smaller screens."
                    },
                    {
                        "comment": "sdk-ui-catalog: Render `createdAt` in the table as a fallback when `updatedAt` is not defined in the measure metadata object."
                    },
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "sdk-ui-catalog: Update wording and detail page, Support [space] in tag management"
                    },
                    {
                        "comment": "[sdk-ui-kit]: Update design of async table to match figma specifications"
                    },
                    {
                        "comment": "[sdk-gen-ai]: Added sorting for top / bottom ranking filter"
                    },
                    {
                        "comment": "[sdk-ui-kit]: Support override empty state in async table, default component exported"
                    },
                    {
                        "comment": "[sdk-ui-catalog] Update designs of empty table"
                    },
                    {
                        "comment": "[sdk-ui-catalog] Support theming in workspace catalog page"
                    },
                    {
                        "comment": "[sdk-ui-gen-ai] Cannot move cursor back with keyboard after selecting an object from AutoComplete."
                    },
                    {
                        "comment": "[sdk-backend-tiger] Fix message resolution when reach limit size of request"
                    },
                    {
                        "comment": "Improved accessibility of saved views and attribute filter"
                    },
                    {
                        "comment": "Improve accessibility of the saved views list"
                    },
                    {
                        "comment": "Use proper color for pattern fill chart tooltips"
                    },
                    {
                        "comment": "Add cron-parser to sdk-ui-ext"
                    },
                    {
                        "comment": "Remove code related to the obsolete enableKDWidgetCustomHeight setting"
                    },
                    {
                        "comment": "remove legacy code related to the old layouting "
                    },
                    {
                        "comment": "Prevent re-mounting of automation date filter button"
                    },
                    {
                        "comment": "propagate properly onExportReady callback in Headline"
                    },
                    {
                        "comment": "enable charts accessibility improvements by default"
                    },
                    {
                        "comment": "Add support for React 19 and drop support for older React versions (16, 17). See [migration guide](https://www.gooddata.com/docs/gooddata-ui/latest/quick_start/#update-from-v10-to-v11)."
                    }
                ],
                "minor": [
                    {
                        "comment": "Added GenAI Memory management types and interfaces - new IGenAIMemoryItem, IGenAIMemoryItemCreate, GenAIMemoryItemType from sdk-model and IMemoryService interface from sdk-backend-spi for CRUD operations on AI memory items"
                    }
                ]
            }
        },
        {
            "version": "10.43.0",
            "tag": "@gooddata/sdk-ui-all_v10.43.0",
            "date": "Thu, 11 Sep 2025 07:36:12 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "sdk-ui-dashboard: Added evaluation mode checkbox to schedule exports dialog"
                    },
                    {
                        "comment": "sdk-model: Introduced `isLocked` property in `IAttributeMetadataObject` and `IFactMetadataObject` interfaces."
                    },
                    {
                        "comment": "sdk-ui-catalog: Restrict updates for parent's workspace objects."
                    },
                    {
                        "comment": "sdk-ui-catalog: Sort catalog items based on search results score"
                    },
                    {
                        "comment": "sdk-ui-catalog: Implement object type counter to display the number of occurrences for each object type in the results."
                    },
                    {
                        "comment": "New icons in kit, catalog icons update per type"
                    },
                    {
                        "comment": "GDAI-625 - filter by PARENT | CHILD not working"
                    },
                    {
                        "comment": "fe support for ranking filter in AI Assistant"
                    },
                    {
                        "comment": "fix: [Catalog] User with ANALYZE workspace permission can NOT edit all visualization or Dashboard they have edit access to"
                    },
                    {
                        "comment": "fix: [Catalog] Detail view - \"Last modified by\" show User Id when update by user Manage ws permission"
                    },
                    {
                        "comment": "Can NOT remove the description of object detail, Object details - Visualization - Missing \"Created by\" and \"Last modified by\" after refresh page"
                    },
                    {
                        "comment": "Suppress row click to open the tag component, Long object ID content overflows the infomation dialog."
                    },
                    {
                        "comment": "limit for ai assistant search in feature flag"
                    },
                    {
                        "comment": "sdk-ui-catalog: design QA of Analytics Catalogue"
                    },
                    {
                        "comment": " sdk-ui-catalog: design QA of Analytics Catalogue"
                    },
                    {
                        "comment": "fe support for ranking filter in AI Assistant"
                    },
                    {
                        "comment": "Updates to tooltip and popover components"
                    },
                    {
                        "comment": "Update table component to support align and some css tune"
                    },
                    {
                        "comment": "Improved the accessibility of attribute filter."
                    },
                    {
                        "comment": "Fixed dashboard charts flickering under specific conditions."
                    },
                    {
                        "comment": "Redesign Dashboard's Date filter for better accessibility"
                    },
                    {
                        "comment": "Make description trigger better with screen reader"
                    },
                    {
                        "comment": "Add identifier prop for description tooltip component"
                    },
                    {
                        "comment": "Improve accessibility of switchToTable feature"
                    },
                    {
                        "comment": "Improve support for Windows High Contrast Mode"
                    },
                    {
                        "comment": "Make focus ring more visible on headline primary value"
                    },
                    {
                        "comment": "Improve initial autofocus in date filter"
                    },
                    {
                        "comment": "Improve disable export options with accessible tooltip"
                    },
                    {
                        "comment": "Avoid double execution when rendering charts with InsightView"
                    },
                    {
                        "comment": "Added: chart fill support for a bullet chart"
                    },
                    {
                        "comment": "Changed: Chart fill patterns were updated for the better legibility on non-retina displays"
                    },
                    {
                        "comment": "Fix: Render paragraph text in UiTooltip with the normal text color"
                    },
                    {
                        "comment": "Added: data test id prop to SDK UI Kit Input component."
                    }
                ]
            }
        },
        {
            "version": "10.42.0",
            "tag": "@gooddata/sdk-ui-all_v10.42.0",
            "date": "Thu, 04 Sep 2025 08:00:17 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduced a help icon with tooltip in the header, providing users with information about the Analytics Catalog."
                    },
                    {
                        "comment": "Introduce optional `id` array field to `IFilterBaseOptions`"
                    },
                    {
                        "comment": "Updated the `useSemanticSearch` hook to pass `deepSearch` boolean value. This fixes previous behavior when `true` value was always passed."
                    },
                    {
                        "comment": "Updated the `useSemanticSearch` hook to ignore state changes when the search request is aborted, ensuring that no updates occur after cancellation."
                    },
                    {
                        "comment": " Integrate the semantic search functionality into the Analytics Catalog. "
                    },
                    {
                        "comment": "Show created by display name in Analytics Catalog when possible"
                    },
                    {
                        "comment": "sdk-model: Added `ObjectOrigin` type to define the origin of objects for inheritance-based filtering."
                    },
                    {
                        "comment": "sdk-backend-spi/tiger: Add origin filtering to query interfaces"
                    },
                    {
                        "comment": "sdk-catalog: Introduce filtering capabilities for object origins"
                    },
                    {
                        "comment": "sdk-ui-catalog: Re-order object type selection"
                    },
                    {
                        "comment": "Add suport for opening view details on catalog item. now empty"
                    },
                    {
                        "comment": "Implement first version of catalog detail"
                    },
                    {
                        "comment": "Support opening view details on catalog item when id is provided. Fill detail page of catalog item, now only in read only view."
                    },
                    {
                        "comment": "Analytics Catalog: Support for update title, description and tags on dashboard, vis and metric"
                    },
                    {
                        "comment": "Support for update title, description and tags on facts and attributes"
                    },
                    {
                        "comment": "Improve chart legends accessibility"
                    },
                    {
                        "comment": "Respect the allowUnsafeFlexConnectEndpoints setting on the UI"
                    },
                    {
                        "comment": "Fix reference workspace provisioning scripts"
                    },
                    {
                        "comment": "Remove the enableNewUserCreationFlow feature flag and related code."
                    },
                    {
                        "comment": "Migrate to the latest OpenAPI generator version"
                    },
                    {
                        "comment": "Allow customization of chart data labels by theme.Deprecate some theme.chart properties and replace them by more hierarchical equivalents. Eg. theme.chart.axisValueColor replaced by theme.chart.axis.valueColor"
                    },
                    {
                        "comment": "Introduce configurable chart point shapes (square, triangle, triangle-down, diamond)."
                    },
                    {
                        "comment": "feat: Add support for en-US-x-24h locale with timezone formatting"
                    },
                    {
                        "comment": "Introduce configurable chart fill (solid, pattern, outline)."
                    },
                    {
                        "comment": "Fixed: Postponed HighChart resizing till the chart is really mounted to prevent error when treemap and heatmap charts are initialy rendered or destroyed when pattern is applied."
                    },
                    {
                        "comment": "Added: Introduce a property to map the pattern fill per measure"
                    },
                    {
                        "comment": "convert minute/hour granularities of en-US-x-24h locale to UTC before passing to formatInTimezone due to time conversion already happening on BE and then again within this function"
                    }
                ]
            }
        },
        {
            "version": "10.41.0",
            "tag": "@gooddata/sdk-ui-all_v10.41.0",
            "date": "Thu, 28 Aug 2025 07:43:12 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Extend `IDashboardsQuery` and `IInsightsQuery` with additional filtering and include parameters capabilities."
                    },
                    {
                        "comment": "Update `createdBy` in `IFilterBaseOptions` to accept an array"
                    },
                    {
                        "comment": "UiDrawer component"
                    },
                    {
                        "comment": "GDAI-589 catalog list should be sorted alphabetically"
                    },
                    {
                        "comment": "Propagate visualization title and description to chart accessibility"
                    },
                    {
                        "comment": "Fix: Read the latest toast message even while a modal window is open"
                    },
                    {
                        "comment": "Show as table/original visualization on drill dialog only affects this specific insight."
                    }
                ]
            }
        },
        {
            "version": "10.40.0",
            "tag": "@gooddata/sdk-ui-all_v10.40.0",
            "date": "Thu, 21 Aug 2025 07:17:56 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Add theme variables to control message styling"
                    },
                    {
                        "comment": "Links rendered by the repeater visualization respect the theme now."
                    },
                    {
                        "comment": "Remove enableNewHeadline feature flag and old headline code"
                    }
                ]
            }
        },
        {
            "version": "10.39.0",
            "tag": "@gooddata/sdk-ui-all_v10.39.0",
            "date": "Thu, 14 Aug 2025 10:14:08 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Improved accessibility of notification toast messages."
                    },
                    {
                        "comment": "UiIconButton now supports the tabIndex property."
                    },
                    {
                        "comment": "Improve keyboard navigation in drill dialog with table"
                    },
                    {
                        "comment": "Increased contrast in the data picker component to make it more accessible."
                    },
                    {
                        "comment": "Introduce new icons into UiIcon component."
                    },
                    {
                        "comment": "Make various dashboard menu icons to respect the theme (schedules, drills, save dashboard as new)."
                    }
                ]
            }
        },
        {
            "version": "10.38.0",
            "tag": "@gooddata/sdk-ui-all_v10.38.0",
            "date": "Thu, 07 Aug 2025 08:23:00 GMT",
            "comments": {}
        },
        {
            "version": "10.37.0",
            "tag": "@gooddata/sdk-ui-all_v10.37.0",
            "date": "Thu, 31 Jul 2025 07:50:16 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Fix focusing of hidden legend items"
                    }
                ]
            }
        },
        {
            "version": "10.36.0",
            "tag": "@gooddata/sdk-ui-all_v10.36.0",
            "date": "Tue, 29 Jul 2025 13:43:27 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Fix keyboard navigation in chart legend"
                    }
                ]
            }
        },
        {
            "version": "10.35.0",
            "tag": "@gooddata/sdk-ui-all_v10.35.0",
            "date": "Thu, 24 Jul 2025 10:25:27 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "fix of selection mode switching. Allow propagation of invalid AF selection together with isInvalid flag. Dashboard component can now handle invalid state."
                    },
                    {
                        "comment": "Rewrite logic for withoutApply mode. Fixing child filter selection."
                    },
                    {
                        "comment": "Deprecate enableDashboardFiltersApplyModes prop and use only withoutApply."
                    },
                    {
                        "comment": "Upgrade typescript to version 5.8.3"
                    },
                    {
                        "comment": "support threshold measure in combo chart & support excluding data series measures from being affected by threshold measure"
                    },
                    {
                        "comment": "feat(api-client-tiger): upgrade the API client to match the latest backend REST API capabilities"
                    }
                ]
            }
        },
        {
            "version": "10.34.0",
            "tag": "@gooddata/sdk-ui-all_v10.34.0",
            "date": "Mon, 14 Jul 2025 09:23:49 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "remove obsolete UiMenu props "
                    },
                    {
                        "comment": "fix(sdk-ui-dashboard): documentation link displayed in tooltip shown over the new Column container item of dashboard leads to the related part of documentation page now"
                    },
                    {
                        "comment": "fix(sdk-ui-dashboard): render row end hotspot only when a widget is dragged to fix the row height resizer offset in the column container"
                    },
                    {
                        "comment": "fix(sdk-ui-dashboard): make widget a width resizer the same thickness as a height resizer"
                    },
                    {
                        "comment": "feat: introduce a new feature flag for pre-aggregated facts"
                    },
                    {
                        "comment": "fix(sdk-ui-dashboard): introduce and use a new feature flag to enable Flexible Layout to not enable the uncomplete feature in previously released SDKs"
                    }
                ]
            }
        },
        {
            "version": "10.33.0",
            "tag": "@gooddata/sdk-ui-all_v10.33.0",
            "date": "Thu, 10 Jul 2025 06:54:29 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Updated state management libraries, like @reduxjs/toolkit, immer, redux, reselect"
                    },
                    {
                        "comment": "Exclude width resizer preview from auto scroll behavior. It prevents dashboard content from vertical scroll when only horizontal movement of resizer is happening"
                    },
                    {
                        "comment": "Replace ~@gooddata/ imports in scss files with @gooddata/ to allow integration with next.js"
                    },
                    {
                        "comment": "Enable flexible dashboard layouts with nesting support by default."
                    },
                    {
                        "comment": "Allow resizing of flexible layout containers with nested row containers inside of them."
                    },
                    {
                        "comment": "Make the last column drop zone in flexible layouts take all the remaining space of the column."
                    },
                    {
                        "comment": "Size flexible layout containers to full row height to have the last drop zone fill the remaining space of the column."
                    },
                    {
                        "comment": "Do not render the flexible layout previous row's row end drop zone."
                    }
                ]
            }
        },
        {
            "version": "10.32.0",
            "tag": "@gooddata/sdk-ui-all_v10.32.0",
            "date": "Mon, 30 Jun 2025 11:32:45 GMT",
            "comments": {}
        },
        {
            "version": "10.31.0",
            "tag": "@gooddata/sdk-ui-all_v10.31.0",
            "date": "Mon, 16 Jun 2025 14:58:30 GMT",
            "comments": {}
        },
        {
            "version": "10.30.0",
            "tag": "@gooddata/sdk-ui-all_v10.30.0",
            "date": "Mon, 09 Jun 2025 16:54:46 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Added method for setting metadata locale to settings services"
                    }
                ]
            }
        },
        {
            "version": "10.29.0",
            "tag": "@gooddata/sdk-ui-all_v10.29.0",
            "date": "Thu, 05 Jun 2025 07:23:01 GMT",
            "comments": {}
        },
        {
            "version": "10.28.0",
            "tag": "@gooddata/sdk-ui-all_v10.28.0",
            "date": "Thu, 29 May 2025 06:57:15 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduced embeddable AI Assistant as part of public API"
                    },
                    {
                        "comment": "fix attribute filter not reloading values after dropdown close when some search query is not empty"
                    },
                    {
                        "comment": "fix failing storybook test for AttributeFilterStatusBar"
                    },
                    {
                        "comment": "Change chart's X axis label autorotation value from -90° to -45°"
                    }
                ]
            }
        },
        {
            "version": "10.27.0",
            "tag": "@gooddata/sdk-ui-all_v10.27.0",
            "date": "Fri, 16 May 2025 08:01:14 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Fix irrelevant values info in attribute filter when apply all at once is on"
                    }
                ]
            }
        },
        {
            "version": "10.26.0",
            "tag": "@gooddata/sdk-ui-all_v10.26.0",
            "date": "Mon, 05 May 2025 06:30:05 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "add property drillStep into InsightBody component so dashboard customizations can behave based on drill context"
                    }
                ]
            }
        },
        {
            "version": "10.25.1",
            "tag": "@gooddata/sdk-ui-all_v10.25.1",
            "date": "Wed, 23 Apr 2025 14:19:46 GMT",
            "comments": {}
        },
        {
            "version": "10.25.0",
            "tag": "@gooddata/sdk-ui-all_v10.25.0",
            "date": "Thu, 17 Apr 2025 06:58:58 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Make relative range picker more accessible"
                    },
                    {
                        "comment": "Make relative range picker more accessible"
                    }
                ]
            }
        },
        {
            "version": "10.24.0",
            "tag": "@gooddata/sdk-ui-all_v10.24.0",
            "date": "Thu, 03 Apr 2025 11:48:06 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Update minimal node to 22.13.0"
                    },
                    {
                        "comment": "Fix: Do not reset date filter on cancel click in apply all filters at once mode"
                    },
                    {
                        "comment": "Bugfix of attribute filter. When together apply all filters and close values dropdown with filled search the app crashes."
                    },
                    {
                        "comment": "Dashboard execution and rendering is not blocked by loading of catalog"
                    }
                ]
            }
        },
        {
            "version": "10.23.0",
            "tag": "@gooddata/sdk-ui-all_v10.23.0",
            "date": "Thu, 20 Mar 2025 09:15:55 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Update ag-grid-community and ag-grid-react library to latest version"
                    },
                    {
                        "comment": "Add an option to specify chart tooltip class name"
                    },
                    {
                        "comment": "Support of new filter mode Apply all at once in Dashboard"
                    }
                ]
            }
        },
        {
            "version": "10.22.0",
            "tag": "@gooddata/sdk-ui-all_v10.22.0",
            "date": "Thu, 06 Mar 2025 08:46:39 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "New helper factory createRedirectToTigerAuthenticationWithParams to create a parametrized redirectToTigerAuthentication handler. Useful in Federated Identity Management context."
                    },
                    {
                        "comment": "Add support for execution cancelling via AbortController."
                    },
                    {
                        "comment": "Support workspace and organization level setting for Dashboard filters apply mode"
                    },
                    {
                        "comment": "Make DashboardAttributeFilter component customizable by prop"
                    },
                    {
                        "comment": "Add support for enableDashboardFiltersApplyModes feature flag"
                    },
                    {
                        "comment": "Update HighCharts library to latest version"
                    }
                ]
            }
        },
        {
            "version": "10.20.0",
            "tag": "@gooddata/sdk-ui-all_v10.20.0",
            "date": "Thu, 20 Feb 2025 08:45:08 GMT",
            "comments": {}
        },
        {
            "version": "10.19.0",
            "tag": "@gooddata/sdk-ui-all_v10.19.0",
            "date": "Thu, 06 Feb 2025 07:58:07 GMT",
            "comments": {}
        },
        {
            "version": "10.18.0",
            "tag": "@gooddata/sdk-ui-all_v10.18.0",
            "date": "Thu, 23 Jan 2025 08:58:58 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduce NotificationPanel component."
                    }
                ]
            }
        },
        {
            "version": "10.17.0",
            "tag": "@gooddata/sdk-ui-all_v10.17.0",
            "date": "Thu, 09 Jan 2025 09:00:05 GMT",
            "comments": {}
        },
        {
            "version": "10.16.0",
            "tag": "@gooddata/sdk-ui-all_v10.16.0",
            "date": "Thu, 12 Dec 2024 07:29:13 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Add support for nested dashboard layouts (hidden behind a feature flag) "
                    }
                ]
            }
        },
        {
            "version": "10.15.0",
            "tag": "@gooddata/sdk-ui-all_v10.15.0",
            "date": "Thu, 28 Nov 2024 11:23:13 GMT",
            "comments": {}
        },
        {
            "version": "10.14.0",
            "tag": "@gooddata/sdk-ui-all_v10.14.0",
            "date": "Thu, 14 Nov 2024 11:46:42 GMT",
            "comments": {}
        },
        {
            "version": "10.13.0",
            "tag": "@gooddata/sdk-ui-all_v10.13.0",
            "date": "Thu, 31 Oct 2024 08:50:19 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "attribute filters now allow improved work with duplicate values by default"
                    },
                    {
                        "comment": "Added new Visualization Switcher widget to render group of visualizations together on dashboard (available for GoodData.CN / GoodData Cloud only)."
                    }
                ]
            }
        },
        {
            "version": "10.12.0",
            "tag": "@gooddata/sdk-ui-all_v10.12.0",
            "date": "Thu, 17 Oct 2024 06:56:12 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduce support for saved filter views on dashboards. It allows to customize filter context for individual user and dashboard and save it for later use."
                    }
                ]
            }
        },
        {
            "version": "10.11.0",
            "tag": "@gooddata/sdk-ui-all_v10.11.0",
            "date": "Thu, 03 Oct 2024 07:11:15 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduce support for saved filter views on dashboards. It allows to customize filter context for individual user and dashboard and save it for later use."
                    }
                ]
            }
        },
        {
            "version": "10.10.0",
            "tag": "@gooddata/sdk-ui-all_v10.10.0",
            "date": "Thu, 19 Sep 2024 06:58:04 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Improved Handling of Secondary Labels in AttributeFilter"
                    }
                ]
            }
        },
        {
            "version": "10.9.0",
            "tag": "@gooddata/sdk-ui-all_v10.9.0",
            "date": "Thu, 05 Sep 2024 08:14:25 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Add possibility to ignore specified attributes in the drill down intersection. Modify addDrillDownForInsightWidget and modifyDrillDownForInsightWidget commands to be able to configure it (breaking)."
                    }
                ]
            }
        },
        {
            "version": "10.8.0",
            "tag": "@gooddata/sdk-ui-all_v10.8.0",
            "date": "Thu, 22 Aug 2024 07:33:19 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduce user filter views to dashboard component"
                    }
                ]
            }
        },
        {
            "version": "10.7.0",
            "tag": "@gooddata/sdk-ui-all_v10.7.0",
            "date": "Thu, 08 Aug 2024 09:46:36 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduced GenAI Service in sdk-backend-tiger to be able to consume semantic search feeds."
                    },
                    {
                        "comment": "Introduced @gooddata/sdk-ui-semantic-search package in alpha stage"
                    },
                    {
                        "comment": "Top menu UI component now supports a new search button"
                    }
                ]
            }
        },
        {
            "version": "10.6.0",
            "tag": "@gooddata/sdk-ui-all_v10.6.0",
            "date": "Thu, 25 Jul 2024 08:35:32 GMT",
            "comments": {}
        },
        {
            "version": "10.5.1",
            "tag": "@gooddata/sdk-ui-all_v10.5.1",
            "date": "Fri, 12 Jul 2024 11:00:39 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Fixed display of tooltips in drill dialog"
                    }
                ]
            }
        },
        {
            "version": "10.5.0",
            "tag": "@gooddata/sdk-ui-all_v10.5.0",
            "date": "Thu, 11 Jul 2024 08:01:45 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Allow specifying returnTo parameter with backend deauthenticate"
                    },
                    {
                        "comment": "Adjusted export function to support pdf options."
                    },
                    {
                        "comment": "Using visualizationObject whenever provided as alternative to executionResult for export."
                    }
                ]
            }
        },
        {
            "version": "10.4.0",
            "tag": "@gooddata/sdk-ui-all_v10.4.0",
            "date": "Thu, 27 Jun 2024 08:11:53 GMT",
            "comments": {}
        },
        {
            "version": "10.3.0",
            "tag": "@gooddata/sdk-ui-all_v10.3.0",
            "date": "Thu, 13 Jun 2024 08:17:52 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Allow different position of ellipsis in ShortenedText component "
                    },
                    {
                        "comment": "F1-349 Implement webhooks api in tiger functions"
                    },
                    {
                        "comment": "allow creating a workspace as a child"
                    }
                ]
            }
        },
        {
            "version": "10.2.0",
            "tag": "@gooddata/sdk-ui-all_v10.2.0",
            "date": "Thu, 30 May 2024 08:50:26 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "API method importCsv now returns update info about file"
                    },
                    {
                        "comment": "Forecast implementation into line chart"
                    },
                    {
                        "comment": "Include hierarchy data in workspace descriptor"
                    },
                    {
                        "comment": "added filter for root workspaces only to workspaces query"
                    },
                    {
                        "comment": "use only description attribute for workspace description"
                    },
                    {
                        "comment": "Enhanced export function to support PDF format and added PDF configuration option."
                    }
                ]
            }
        },
        {
            "version": "10.1.0",
            "tag": "@gooddata/sdk-ui-all_v10.1.0",
            "date": "Thu, 16 May 2024 08:08:00 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Added a workspace service for working with export definitions metadata objects"
                    }
                ]
            }
        },
        {
            "version": "10.0.0",
            "tag": "@gooddata/sdk-ui-all_v10.0.0",
            "date": "Thu, 18 Apr 2024 08:07:32 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Drop support for the GoodData Platform (Bear) in all packages."
                    },
                    {
                        "comment": "Removed the @gooddata/experimental-workspace and @gooddata/live-examples-workspace packages."
                    },
                    {
                        "comment": "Removed the sdk-examples package."
                    },
                    {
                        "comment": "Package @gooddata/reference-workspace migrated from GoodData Platform (Bear) to GoodData.CN (Panther/Tiger)."
                    },
                    {
                        "comment": "Removed GoodData Platform (Bear) related packages: @gooddata/api-client-bear, @gooddata/sdk-backend-bear, @gooddata/api-model-bear."
                    },
                    {
                        "comment": "Introduced a new visualization type - Repeater, currently in the @beta stage."
                    },
                    {
                        "comment": "Introduce ability to limit attribute filter values by dependent date filters on GoodData Cloud dashboards."
                    }
                ]
            }
        },
        {
            "version": "9.9.2",
            "tag": "@gooddata/sdk-ui-all_v9.9.2",
            "date": "Wed, 19 Mar 2025 11:50:06 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Update ag-grid-community and ag-grid-react library to latest version"
                    }
                ]
            }
        },
        {
            "version": "9.9.1",
            "tag": "@gooddata/sdk-ui-all_v9.9.1",
            "date": "Thu, 18 Apr 2024 11:19:00 GMT",
            "comments": {}
        },
        {
            "version": "9.9.0",
            "tag": "@gooddata/sdk-ui-all_v9.9.0",
            "date": "Thu, 21 Mar 2024 09:56:41 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "To unify null values representation replace pattern fill by background color in Heatmap"
                    },
                    {
                        "comment": "Introduce theme loading status with better information about state of theme loading"
                    },
                    {
                        "comment": "Add tags to 'measure' objects"
                    }
                ]
            }
        },
        {
            "version": "9.8.1",
            "tag": "@gooddata/sdk-ui-all_v9.8.1",
            "date": "Fri, 15 Mar 2024 13:31:24 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Introduce theme loading status with better information about state of theme loading"
                    }
                ]
            }
        },
        {
            "version": "9.8.0",
            "tag": "@gooddata/sdk-ui-all_v9.8.0",
            "date": "Thu, 07 Mar 2024 09:02:52 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Rename word 'Insight' to 'Visualization'"
                    },
                    {
                        "comment": "Add services to list insights and dashboards with paging"
                    }
                ]
            }
        },
        {
            "version": "9.7.0",
            "tag": "@gooddata/sdk-ui-all_v9.7.0",
            "date": "Thu, 22 Feb 2024 09:17:23 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Added new RichText widget to render markdown on dashboard (available for GoodData.CN / GoodData Cloud only)."
                    },
                    {
                        "comment": "Introduced possibility to use multiple date filters (available for GoodData.CN / GoodData Cloud only)."
                    },
                    {
                        "comment": "Introduce ability to limit attribute filter values by metric on GoodData Cloud dashboards."
                    }
                ]
            }
        },
        {
            "version": "9.6.0",
            "tag": "@gooddata/sdk-ui-all_v9.6.0",
            "date": "Thu, 25 Jan 2024 10:00:31 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Deliver support for multiple date filters fully specified including date data set"
                    },
                    {
                        "comment": "Introduce cross-filtering highlighting in charts."
                    }
                ]
            }
        },
        {
            "version": "9.5.0",
            "tag": "@gooddata/sdk-ui-all_v9.5.0",
            "date": "Thu, 11 Jan 2024 12:13:13 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Users can create multiple insight interactions per attribute/measure for the Panther environment."
                    },
                    {
                        "comment": "Users can create, edit, and delete attribute hierarchies in the UI. Additionally, they can view and interact with a list of drill-down interactions."
                    },
                    {
                        "comment": "Support for dependent filters on Tiger backend added. Attribute filter on Tiger can now be dependent on other filters which will effectively filter out some of its elements. It supports circular dependencies in filters, keeping selected values when parent filter changes and showing/clearing of filtered out elements."
                    },
                    {
                        "comment": "Introduce cross-filtering for GoodData Cloud"
                    },
                    {
                        "comment": "Dashboard plugins no longer support version lock of the GoodData.UI dependencies. Since now, all GoodData.UI dependencies will be injected to the plugin in their latest version at runtime. Also improve way to specify compatibility of the plugin."
                    },
                    {
                        "comment": "Add support for attribute filter selection in drill to custom url."
                    },
                    {
                        "comment": "Enable decorating attribute filters in plugins customization API."
                    },
                    {
                        "comment": "Enable decorating dashboard content in plugins customization API."
                    }
                ]
            }
        },
        {
            "version": "9.4.0",
            "tag": "@gooddata/sdk-ui-all_v9.4.0",
            "date": "Thu, 30 Nov 2023 11:57:11 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Users can configure the dashboard filter to be interactive, locked, or hidden."
                    },
                    {
                        "comment": "Remove `isDomainAdmin` method from Bear Legacy Functions. "
                    }
                ]
            }
        },
        {
            "version": "9.3.0",
            "tag": "@gooddata/sdk-ui-all_v9.3.0",
            "date": "Thu, 02 Nov 2023 11:25:49 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "The headline allows two secondary measures to be displayed as the headline values."
                    },
                    {
                        "comment": "The headline allows for the customization of comparison values and styles using the comparison config."
                    },
                    {
                        "comment": "Introduce possibility to cache client calls"
                    }
                ]
            }
        },
        {
            "version": "9.2.0",
            "tag": "@gooddata/sdk-ui-all_v9.2.0",
            "date": "Fri, 06 Oct 2023 13:12:04 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Supporting to share the dashboard with all workspace users."
                    },
                    {
                        "comment": "Introduce new attribute hierarchy catalog entity which is used for implicit drill-down in dashboards."
                    }
                ]
            }
        },
        {
            "version": "9.1.0",
            "tag": "@gooddata/sdk-ui-all_v9.1.0",
            "date": "Fri, 08 Sep 2023 07:19:23 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Added support for pivot tables, allowing you to transpose column headers to rows for more flexible data analysis."
                    },
                    {
                        "comment": "The pivot table allows metrics to be placed in rows instead of columns."
                    },
                    {
                        "comment": "Optimized attribute filter to fetch element counts only for child filters, reducing overhead and improving performance by not fetching the total count of elements by default."
                    },
                    {
                        "comment": "Sdk-backend-tiger now supports the following entity properties: createdAt, createdBy, modifiedAt, modifedBy for the following analytical objects: insight, analytical dashboard, dashboard plugin, metric."
                    },
                    {
                        "comment": "Sdk-backend-tiger now supports JWT authentication."
                    },
                    {
                        "comment": "Added support for Waterfall chart visualizations."
                    }
                ]
            }
        },
        {
            "version": "9.0.1",
            "tag": "@gooddata/sdk-ui-all_v9.0.1",
            "date": "Thu, 17 Aug 2023 13:20:29 GMT",
            "comments": {}
        },
        {
            "version": "9.0.0",
            "tag": "@gooddata/sdk-ui-all_v9.0.0",
            "date": "Thu, 27 Jul 2023 12:35:32 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "catalog-export: unified the way configuration is loaded for tiger and bear"
                    },
                    {
                        "comment": "sdk-backend-tiger: add apis to config localization, timezone for organization"
                    },
                    {
                        "comment": "Change build target of all libraries to ES2017"
                    },
                    {
                        "comment": "update minimal node version to 16.20.0"
                    },
                    {
                        "comment": "Single selection variant of Attribute Filter component"
                    },
                    {
                        "comment": "Remove all enzyme related packages and rewrite tests to react testing library."
                    },
                    {
                        "comment": "Upgrade TypeScript to v5."
                    },
                    {
                        "comment": "Add Dependency wheel chart visualizations."
                    },
                    {
                        "comment": "Add Sankey chart visualizations."
                    },
                    {
                        "comment": "Add @gooddata/app-toolkit as replacement for @gooddata/create-gooddata-react-app"
                    },
                    {
                        "comment": "Deprecated APIs were removed."
                    },
                    {
                        "comment": "Attribute Filter Dropdown button supports description customisation in form of tooltip"
                    },
                    {
                        "comment": "Add Funnel chart and Pyramid chart visualizations."
                    },
                    {
                        "comment": "The new SPI export methods for downloading of insight and dashboard export data were added. The methods attach exported data as a blob to current browser window instance and return Object URL pointing to the blob and name of the downloaded file. There is no need to export data manually via URI. The dashboard component uses these new methods now. This means that export from dashboard component works even when provided backend uses Tiger token authentication."
                    },
                    {
                        "comment": "Make it possible to hide/show on demand the web components tab on embedding dialogs"
                    },
                    {
                        "comment": "Add the continuous line configuration for the Line, Area and Combo charts"
                    }
                ]
            }
        },
        {
            "version": "8.12.3",
            "tag": "@gooddata/sdk-ui-all_v8.12.3",
            "date": "Thu, 05 Oct 2023 07:58:45 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Use @gooddata/number-formatter instead of @gooddata/numberjs library"
                    }
                ]
            }
        },
        {
            "version": "8.12.2",
            "tag": "@gooddata/sdk-ui-all_v8.12.2",
            "date": "Wed, 19 Jul 2023 14:12:54 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "The new SPI export methods for downloading of insight and dashboard export data were added. The methods attach exported data as a blob to current browser window instance and return Object URL pointing to the blob and name of the downloaded file. There is no need to export data manually via URI. The dashboard component uses these new methods now. This means that export from dashboard component works even when provided backend uses Tiger token authentication."
                    }
                ]
            }
        },
        {
            "version": "8.12.1",
            "tag": "@gooddata/sdk-ui-all_v8.12.1",
            "date": "Mon, 17 Apr 2023 08:24:37 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Add fallback for unknown visualization types of insights"
                    }
                ]
            }
        },
        {
            "version": "8.12.0",
            "tag": "@gooddata/sdk-ui-all_v8.12.0",
            "date": "Thu, 09 Mar 2023 08:43:20 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Dashboard component and dashboard plugins now supports edit mode."
                    },
                    {
                        "comment": "Insights and dashboard widgets now allow to specify description in form of tooltips."
                    },
                    {
                        "comment": "Analytical dashboards created in GoodData Cloud are now created as private visible only to the creator and to all organization and workspace administrators. SDK allows granular sharing of any dashboard with selected users and user groups. Dashboard permissions can be managed via SPI library and are fully integrated into the Dashboard component."
                    },
                    {
                        "comment": "Export permissions have been made more granular and the EXPORT permission now includes both EXPORT_TABULAR and EXPORT_PDF. Export permissions can also be set individually to allow exports to certain formats only."
                    },
                    {
                        "comment": "Improved GoodData Cloud formatting of date attributes based on locale user setting and defined formatting pattern."
                    },
                    {
                        "comment": "Add support for PDF export for GoodData Cloud."
                    },
                    {
                        "comment": "Support Geo Pushpin chart for GoodData Cloud."
                    }
                ]
            }
        },
        {
            "version": "8.11.0",
            "tag": "@gooddata/sdk-ui-all_v8.11.0",
            "date": "Thu, 20 Oct 2022 09:18:18 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Improved custom attribute filters were added. We added support for customization of the AttributeFilter and AttributeFilterButton components and new features, such as static and hidden elements."
                    },
                    {
                        "comment": "Dashboard plugins APIs to customize attribute filters were added. You can now customize the attribute filters with dashboard plugins."
                    },
                    {
                        "comment": "Core API for attribute filter components was added. These components now allow implementation of custom attribute filters."
                    },
                    {
                        "comment": "SDK SPI ability for white-labeling was added. You can enable white-labeling for your organization."
                    },
                    {
                        "comment": "Mapbox token React provider was added."
                    },
                    {
                        "comment": "The withCaching backend decorator has been made public. RecommendedCachingConfiguration from @gooddata/sdk-backend-base can be used to configure backend caching."
                    }
                ]
            }
        },
        {
            "version": "8.10.0",
            "tag": "@gooddata/sdk-ui-all_v8.10.0",
            "date": "Thu, 14 Jul 2022 08:56:22 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "DashboardView component was removed. Use Dashboard component from @gooddata/sdk-ui-dashboard instead."
                    },
                    {
                        "comment": "Support for GoodData Cloud was added."
                    },
                    {
                        "comment": "Dashboard filterContext selectors are public now."
                    },
                    {
                        "comment": "Dashboard component user and permissions selectors are public now."
                    },
                    {
                        "comment": "Catalog load is now more optimized for GoodData Platform."
                    },
                    {
                        "comment": "Model interfaces from @gooddata/sdk-backend-spi were moved to @gooddata/sdk-model."
                    },
                    {
                        "comment": "Global Dashboard CSS styles were removed."
                    },
                    {
                        "comment": "SVG and CSS imports in typescript files were removed, GoodData.UI can be used without an additional bundler setup now"
                    },
                    {
                        "comment": "Execution definition by slices/series can be now used without React. You can use the DataViewLoader @alpha version from @gooddata/sdk-ui."
                    },
                    {
                        "comment": "The useDashboardAsyncRender hook and related commands and events that inform about the dashboard rendering status are now public."
                    }
                ]
            }
        },
        {
            "version": "8.9.0",
            "tag": "@gooddata/sdk-ui-all_v8.9.0",
            "date": "Thu, 17 Mar 2022 12:48:39 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "The dashboard commands and events related to filter modification were included in the public API."
                    },
                    {
                        "comment": "The general dashboard events (such as DashboardSaved) were included in the public API."
                    },
                    {
                        "comment": "The useDispatchDashboardCommand hook was added to make dispatching of the Dashboard commands easier."
                    },
                    {
                        "comment": "The DashboardStoreAccessor, SingleDashboardStoreAccessor and DashboardStoreAccessorRepository classes were added to enable handling of the state of the Dashboard component outside the component itself."
                    }
                ]
            }
        },
        {
            "version": "8.8.0",
            "tag": "@gooddata/sdk-ui-all_v8.8.0",
            "date": "Thu, 27 Jan 2022 08:25:24 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Support for React 17 was added. React 16 is still supported as well."
                    },
                    {
                        "comment": "UI controls for sharing a dashboard with other users were added."
                    },
                    {
                        "comment": "The SPI was extended with the option for managing access permissions of a metadata object."
                    },
                    {
                        "comment": "The SPI was extended with the option for querying user groups in a workspace."
                    },
                    {
                        "comment": "The workspace user service was extended with the option for querying users per page."
                    },
                    {
                        "comment": "The workspace dashboard service was extended with the option for querying dashboards that are accessible only via their URL."
                    },
                    {
                        "comment": "The workspace dashboard interface was extended with information about sharing status and access control mode."
                    },
                    {
                        "comment": "The IListedDashboard interface was extended with the \"availability\" field."
                    },
                    {
                        "comment": "The bug with dashboardPluginHosts validation was fixed."
                    },
                    {
                        "comment": "Geo pushpin charts no longer support Internet Explorer 11."
                    },
                    {
                        "comment": "The option for setting compatibility of dashboard plugins with the minEngineVersion and maxEngineVersion properties was added."
                    }
                ]
            }
        },
        {
            "version": "8.7.1",
            "tag": "@gooddata/sdk-ui-all_v8.7.1",
            "date": "Tue, 14 Dec 2021 13:31:37 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Fixed bug with dashboardPluginHosts validation"
                    }
                ]
            }
        },
        {
            "version": "8.7.0",
            "tag": "@gooddata/sdk-ui-all_v8.7.0",
            "date": "Thu, 02 Dec 2021 08:24:11 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Dashboard, a component for embedding dashboards created in KPI Dashboards, is added in the beta stage."
                    }
                ]
            }
        },
        {
            "version": "8.6.0",
            "tag": "@gooddata/sdk-ui-all_v8.6.0",
            "date": "Thu, 07 Oct 2021 11:37:01 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Opt-in support for loading user information when loading insights and dashboards was added."
                    },
                    {
                        "comment": "Support for data sampling in the charts and the DashboardView component through execution configuration was added (available only in GoodData.CN for Vertica)."
                    }
                ]
            }
        },
        {
            "version": "8.5.1",
            "tag": "@gooddata/sdk-ui-all_v8.5.1",
            "date": "Thu, 26 Aug 2021 13:55:29 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Some redundant token requests prevented."
                    }
                ]
            }
        },
        {
            "version": "8.5.0",
            "tag": "@gooddata/sdk-ui-all_v8.5.0",
            "date": "Thu, 08 Jul 2021 09:09:51 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Support for the data sampling feature of GoodData.CN is added."
                    },
                    {
                        "comment": "Support for approximate count aggregation in GoodData.CN is added."
                    },
                    {
                        "comment": "The AttributeFilterButton component with DateFilter-like styles was added."
                    },
                    {
                        "comment": "Support for parent-child filtering was added to the AttributeFilter and AttributeFilterButton components."
                    }
                ]
            }
        },
        {
            "version": "8.4.0",
            "tag": "@gooddata/sdk-ui-all_v8.4.0",
            "date": "Thu, 03 Jun 2021 09:24:58 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "The DateFilter component is no longer in beta and is considered stable."
                    },
                    {
                        "comment": "In the DateFilter component, the availableGranularities property of relativeForm is deprecated. Use availableGranularities instead."
                    },
                    {
                        "comment": "The option to disable tooltips in charts is added."
                    },
                    {
                        "comment": "The showTitle property and the onInsightLoaded property are added to the InsightView component."
                    },
                    {
                        "comment": "Visualization definition placeholders are added."
                    },
                    {
                        "comment": "The option to make the legend appear as a popup if the visualization is rendered in a too small container is added."
                    },
                    {
                        "comment": "The includeDateGranularities parameter is added to the loadDateDateDataSets request payload."
                    },
                    {
                        "comment": "The Execute components are extended to support LoadingComponent and ErrorComponent."
                    },
                    {
                        "comment": "The layout customizations of the DashboardView component are supported in GoodData.CN."
                    },
                    {
                        "comment": "The useBackendStrict and useWorkspaceStrict hooks are added for better developer experience."
                    }
                ]
            }
        },
        {
            "version": "8.3.1",
            "tag": "@gooddata/sdk-ui-all_v8.3.1",
            "date": "Fri, 14 May 2021 12:00:31 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "Fixed logout flow on Tiger >=1.1"
                    }
                ]
            }
        },
        {
            "version": "8.3.0",
            "tag": "@gooddata/sdk-ui-all_v8.3.0",
            "date": "Wed, 14 Apr 2021 11:56:54 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "DateFilter now hides options with visible: false."
                    },
                    {
                        "comment": "DateFilter now respects name property in AbsoluteForm, RelativeForm and AllTime options."
                    },
                    {
                        "comment": "Highcharts dependency upgraded from version 7.1.1 to 8.2.2"
                    },
                    {
                        "comment": "Date bucket items no longer removed from request body in loadDateDataset (api-client-bear). If you need to remove bucket date items from the request, you have to filter them manually."
                    },
                    {
                        "comment": "GoodData.CN compatibility - this version is the first version fully compatible with GoodData.CN backend"
                    }
                ]
            }
        },
        {
            "version": "8.2.0",
            "tag": "@gooddata/sdk-ui-all_v8.2.0",
            "date": "Thu, 11 Mar 2021 10:47:16 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "The ThemeProvider component is no longer in beta and is considered stable."
                    },
                    {
                        "comment": "DashboardView, a component for embedding dashboards created in KPI Dashboards, is added in the beta stage."
                    },
                    {
                        "comment": "The capability to validate URLs against an organization’s whitelist is added to the backend. Currently, the implementation supports only the sdk-backend-bear package backend. The sdk-backend-tiger package backend considers all validation requests valid. The responses from the backend are cached by the decorated caching backend layer."
                    }
                ]
            }
        },
        {
            "version": "8.1.0",
            "tag": "@gooddata/sdk-ui-all_v8.1.0",
            "date": "Thu, 03 Dec 2020 09:40:04 GMT",
            "comments": {
                "none": [
                    {
                        "comment": "The dateFormat property from a BaseVisualization is passed to the definition of an IPreparedExecution and is transformed in the BearDataView so that the dates in the AFM execution response can be displayed in the desired format."
                    },
                    {
                        "comment": "The catalog-export tool generates comprehensive DateDataset mapping."
                    },
                    {
                        "comment": "ESM builds are added to allow the bundlers supporting them to employ tree shaking and reduce the size of the bundles."
                    },
                    {
                        "comment": "The sdk-ui-theme-provider library containing the ThemeProvider component is added. The component fetches the selected theme object, parses it, and injects the generated CSS variables into the document body to theme the wrapped application."
                    },
                    {
                        "comment": "The date format settings are loaded from the backend to the InsightView component."
                    },
                    {
                        "comment": "A tooltip is added to the value of a ranking filter."
                    },
                    {
                        "comment": "The date format option is added to the Date Filter component."
                    },
                    {
                        "comment": "Hook alternatives for the Execute component (useCancelablePromise, useDataView, useExecution, and useDataExport) are added."
                    }
                ]
            }
        },
        {
            "version": "8.0.0",
            "tag": "@gooddata/sdk-ui-all_v8.0.0",
            "date": "Thu, 08 Oct 2020 07:51:36 GMT",
            "comments": {}
        }
    ]
}
